---
kind: type
id: T:Autodesk.Revit.DB.ProfilePlaneLocation
source: html/7ee6064e-ae88-1efe-a030-dabfae9bacaf.htm
---
# Autodesk.Revit.DB.ProfilePlaneLocation

Indicates the location of Sweep profile plane on the path curve.

## Syntax (C#)
```csharp
public enum ProfilePlaneLocation
```

## Remarks
Use this enum in the NewSweep() method to create generic forms.